In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('fk_data.csv')

In [3]:
data.head()

             NAMES   RANKS                 REVIEWS
0              NaN     NaN                     NaN
1              NaN     NaN                     NaN
2              NaN     NaN                     NaN
3  Dhiraj Lanjewar     5.0          Classy product
4   Priyanka Limbu     1.0  Worst experience ever!

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3368 entries, 0 to 3367
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   NAMES    2403 non-null   object
 1    RANKS   2404 non-null   float64
 2   REVIEWS  2404 non-null   object
dtypes: float64(1), object(2)
memory usage: 79.1+ KB

In [5]:
len(data['REVIEWS'])

3368

In [6]:
data.isna().sum()

NAMES      965
 RANKS     964
REVIEWS    964
dtype: int64

In [7]:
data = data.dropna(subset=['REVIEWS'])

In [8]:
len(data['REVIEWS'])

2404

In [9]:
data.isna().sum()

NAMES      1
 RANKS     0
REVIEWS    0
dtype: int64

In [10]:
data1 = data[['REVIEWS', ' RANKS']]

In [11]:
data1.to_csv('cleaned_data.csv', index=False)